КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_МЧД/КонтурЛогистика_МЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_МЧД</name>
  <attributes>
    <name>НомерДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СведСистОтм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>XMLфайлМЧД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПодпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДиадок</name>
    <comment>Доверитель</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружена</name>
    <comment>1 - из диадока, 2 - из файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доверитель_ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеПредставители</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ФорматыМЧД</types>
    </type>
  </attributes>
  <attributes>
    <name>Наша</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСтатусаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СовместноеОсуществлениеПолномочий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УтратаПолномочийПриПередоверии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПолномочие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПолномочия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДоверитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходнойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданаВПорядкеПередоверия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРодительскойДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьОформленияПередоверия</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВозможностиОформленияПередоверияМЧД</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредставителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представители</name>
    <attributes>
      <name>ТипПредставителя</name>
      <comment>&quot;1&quot; - ЮЛ; &quot;2&quot; - ИП; &quot;3&quot; - ФЛ; &quot;4&quot; - филиал ЮЛ; &quot;5&quot; - филиал иностранного ЮЛ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПредставителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОГРН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоверенныеСертификаты</name>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыдан</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_Полномочия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мнемоника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПолномочия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОграничений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>ИдентификаторПолномочия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовоеЗначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛицаПредставителиЮЛ</name>
    <attributes>
      <name>ИдентификаторПредставителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_МЧД/Forms/ФормаЗагрузкиИзБЭД/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Метаданные.РегистрыСведений.Найти("ЖурналМашиночитаемыхДоверенностей") <> Неопределено Тогда		
		
		СписокМЧД = ПолучитьСписокМЧДИзЖурнала();
		
		Для каждого Стр Из СписокМЧД Цикл
			
			НоваяСтрока = Список.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
							
			НоваяСтрока.Доверители = ПолучитьПредставлениеСубъекта(Стр.Доверители);
			НоваяСтрока.Представители = ПолучитьПредставлениеСубъекта(Стр.Представители);
			
		КонецЦикла;
		
	ИначеЕсли Метаданные.Справочники.Найти("МашиночитаемыеДоверенностиОрганизаций") <> Неопределено Тогда
		
		СписокМЧД = ПолучитьСписокМЧДИзСправочника();
		
		Для каждого Стр Из СписокМЧД Цикл
			
			НоваяСтрока = Список.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
							
			Если Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.Реквизиты.Найти("ДоверительЮЛ_НаимОрг") <> Неопределено Тогда
				
				НоваяСтрока.Доверители = Стр.Доверенность.ДоверительЮЛ_НаимОрг;
				Если Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.Реквизиты.Найти("ДоверительЮЛ_ИНН") <> Неопределено Тогда
					НоваяСтрока.Доверители = НоваяСтрока.Доверители + " ИНН " + Стр.Доверенность.ДоверительЮЛ_ИНН;
				КонецЕсли;
				
				Если Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.ТабличныеЧасти.Найти("Представители") <> Неопределено Тогда
				
					Для Каждого СтрПредставитель Из Стр.Доверенность.Представители Цикл
						НоваяСтрока.Представители = НоваяСтрока.Представители + СтрПредставитель.Представитель;
						Если Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.ТабличныеЧасти.Представители.Реквизиты.Найти("ФЛ_ИНН") <> Неопределено Тогда
							НоваяСтрока.Представители = НоваяСтрока.Представители + " ИНН " + СтрПредставитель.ФЛ_ИНН + "; ";
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.Реквизиты.Найти("Представитель") <> Неопределено Тогда
					
					НоваяСтрока.Представители = Стр.Доверенность.Представитель;
					Если Метаданные.Справочники.МашиночитаемыеДоверенностиОрганизаций.Реквизиты.Найти("ПредставительФЛ_ИНН") <> Неопределено Тогда
						НоваяСтрока.Представители = НоваяСтрока.Представители + " ИНН " + Стр.Доверенность.ПредставительФЛ_ИНН;
					КонецЕсли;					
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМЧДИзЖурнала()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналМашиночитаемыхДоверенностей.Номер КАК Идентификатор,
		|	ЖурналМашиночитаемыхДоверенностей.ВсеДоверители КАК Доверители,
		|	ЖурналМашиночитаемыхДоверенностей.ВсеПредставители КАК Представители,
		|	ЖурналМашиночитаемыхДоверенностей.ДатаВыдачи КАК ДатаВыдачи,
		|	ЖурналМашиночитаемыхДоверенностей.ДатаОкончанияДействия КАК СрокДействия,
		|	ЖурналМашиночитаемыхДоверенностей.Доверенность КАК Доверенность
		|ИЗ
		|	РегистрСведений.ЖурналМашиночитаемыхДоверенностей КАК ЖурналМашиночитаемыхДоверенностей
		|ГДЕ
		|	Не ЖурналМашиночитаемыхДоверенностей.ПометкаУдаления
		|	И ЖурналМашиночитаемыхДоверенностей.ДатаОкончанияДействия > &ТекДата";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	 		
КонецФункции

&НаСервере
Функция ПолучитьСписокМЧДИзСправочника()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МашиночитаемыеДоверенностиОрганизаций.Номер КАК Идентификатор,		
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаВыдачи КАК ДатаВыдачи,
		|	МашиночитаемыеДоверенностиОрганизаций.ДатаОкончанияДействия КАК СрокДействия,
		|	МашиночитаемыеДоверенностиОрганизаций.Ссылка КАК Доверенность
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенностиОрганизаций КАК МашиночитаемыеДоверенностиОрганизаций
		|ГДЕ
		|	ЖурналМашиночитаемыхДоверенностей.Действует
		|	И Не ЖурналМашиночитаемыхДоверенностей.ПометкаУдаления
		|	И ЖурналМашиночитаемыхДоверенностей.ДатаОкончанияДействия > &ТекДата";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	 		
КонецФункции

&НаСервере
Процедура ЗагрузитьМЧД(Доверенность)
	
	ДвоичныеДанныеXMLФайлМЧД = Неопределено;
	ДвоичныеДанныеЭлектроннаяПодпись = Неопределено;
	
	Если ТипЗнч(Доверенность) = Тип("СправочникСсылка.МЧД003") Тогда
		ДвоичныеДанныеXMLФайлМЧД = Доверенность.ФайлМЧД.Получить();
		Если Доверенность.Подписи.Количество() > 0 Тогда
			ДвоичныеДанныеЭлектроннаяПодпись = Доверенность.Подписи[0].Подпись.Получить();	
		КонецЕсли;		
	ИначеЕсли ТипЗнч(Доверенность) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций") 
		Или ТипЗнч(Доверенность) = Тип("СправочникСсылка.МашиночитаемыеДоверенностиКонтрагентов") Тогда
		ДвоичныеДанныеXMLФайлМЧД = Доверенность.XMLфайлМЧД.Получить();
		ДвоичныеДанныеЭлектроннаяПодпись = Доверенность.ЭлектроннаяПодпись.Получить();			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДвоичныеДанныеXMLФайлМЧД) И ЗначениеЗаполнено(ДвоичныеДанныеЭлектроннаяПодпись) Тогда
		КонтурЛогистика_МашиночитаемыеДовернностиСервер.ЗагрузитьМЧДИзФайла(ДвоичныеДанныеXMLФайлМЧД, ДвоичныеДанныеЭлектроннаяПодпись, , Истина); 	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;  
	
	Для каждого ВыдСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ЗагрузитьМЧД(Список.Получить(ВыдСтрока).Доверенность);	
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры

#Область ПредставлениеСубъектов

&НаСервере
Функция ПолучитьПредставлениеСубъекта(ТекстJson)

	Представление = "";
	ДанныеСубъекта = Вычислить("ОбщегоНазначенияБЭД.JSONЗначение(ТекстJson)");
	Если ЗначениеЗаполнено(ДанныеСубъекта) Тогда
		Массив = Новый Массив;
		Для Каждого Субъект Из ДанныеСубъекта Цикл
			Массив.Добавить(СформироватьПредставлениеСубъекта(Субъект));
		КонецЦикла;
		КоличествоСубъектов = Массив.Количество();
		Если КоличествоСубъектов > 1 Тогда
			Массив[0] = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_("[%2] %1", Массив[0], КоличествоСубъектов);
		КонецЕсли;
		Представление = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Массив, "; ");
	Иначе
		Представление = "";
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьПредставлениеСубъекта(Субъект)
	
	Журнал = РегистрыСведений.ЖурналМашиночитаемыхДоверенностей;
	ТипыДоверителей = Журнал.ТипыДоверителей();
	ТипыПредставителей = Журнал.ТипыПредставителей();
	
	Если Субъект.Тип = ТипыДоверителей.ЮридическоеЛицо
		Или Субъект.Тип = ТипыПредставителей.ЮридическоеЛицо Тогда
		Возврат ПредставлениеЮридическогоЛица(Субъект.ДанныеЮридическогоЛица);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ИндивидуальныйПредприниматель 
		Или Субъект.Тип = ТипыПредставителей.ИндивидуальныйПредприниматель Тогда
		Возврат ПредставлениеИндивидуальногоПредпринимателя(Субъект.ДанныеИндивидуальногоПредпринимателя);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ФизическоеЛицо
		Или Субъект.Тип = ТипыПредставителей.ФизическоеЛицо Тогда
		Возврат ПредставлениеФизическогоЛица(Субъект.ДанныеФизическогоЛица);
	ИначеЕсли Субъект.Тип = ТипыДоверителей.ИностраннаяОрганизация Тогда
		Возврат ПредставлениеИностраннойОрганизации(Субъект.ДанныеИностраннойОрганизации);
	ИначеЕсли Субъект.Тип = ТипыПредставителей.ФилиалИностраннойОрганизации Тогда
		Возврат ПредставлениеИностраннойОрганизации(Субъект.ДанныеФилиалаИностраннойОрганизации);
	ИначеЕсли Субъект.Тип = ТипыПредставителей.ФилиалЮридическогоЛица Тогда
		Возврат ПредставлениеЮридическогоЛица(Субъект.ДанныеФилиалаЮридическогоЛица);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеЮридическогоЛица(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "КПП");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] КПП: [КПП]';");
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеИндивидуальногоПредпринимателя(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "СНИЛС");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] СНИЛС: [СНИЛС]';");
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеФизическогоЛица(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "ИНН, СНИЛС");
	Шаблон = НСтр("ru='[ФИО] ИНН: [ИНН] СНИЛС: [СНИЛС]';");
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеИностраннойОрганизации(Знач Данные)
	
	ЗаполнитьПустыеПоля(Данные, "КПП");
	Шаблон = НСтр("ru='[Наименование] ИНН: [ИНН] КПП: [КПП]';");
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, Данные);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПустыеПоля(Структура, КлючиСтрокой)
	
	Ключи = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(КлючиСтрокой, ", ", Ложь);
	Для Каждого Ключ Из Ключи Цикл
		Если Не ЗначениеЗаполнено(Структура[Ключ]) Тогда
			Структура[Ключ] = " -- ";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
